# GetSupportedParameterIds Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ColorFillScheme..::..GetSupportedParameterIds Method
ColorFillScheme Class See Also
---
Retrieves collection of all parameters supported by the scheme.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public IList<ElementId> GetSupportedParameterIds()
```

Visual Basic
---
```text
Public Function GetSupportedParameterIds As IList(Of ElementId)
```

Visual C++
---
```text
public:
IList<ElementId^>^ GetSupportedParameterIds()
```

# Remarks
Supported parameters depends on CategoryId property.
# See Also
ColorFillScheme Class
Autodesk.Revit.DB Namespace